#+TITLE: My Notebook
#+AUTHOR: Liyun Dai (dailiyun2009@163.com)
#+EMAIL: dailiyun2009@163.com


** Getting Started
UNIX Philosophy
+ Simplicity
+ Focus
+ Resuable Components
+ Filters

+ Open File Formats
Util envoroment variables
+ Execute search paths PATH
   #+BEGIN_SRC  sh :results output
echo $PATH
   #+END_SRC

   #+RESULTS:
   : /home/yun/bin:/home/yun/.local/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/home/yun/bin:/home/yun/jdk1.8.0_181/bin

+ Generate static link lib
  #+BEGIN_SRC  sh :results output
ar crv libfoo.a bill.o fred.o
randlib libfoo.a
  #+END_SRC


